БухЭксп/Catalogs/CW_ОбщиеШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ОбщиеШаблоныДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МасштабПодписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиКолонтитулов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКолонтитулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ОбщиеШаблоныДокументов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("НазначениеШаблона", НазначениеШаблона);   
	
	CW_ШаблоныДокументовСерверВызовСервера.ПриСозданииФормыСпискаНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеШаблонаОтборПриИзменении(Элемент)
	УстановитьОтборСписка();	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСписка() 
	
	Список.Отбор.Элементы.Очистить();

	НовыйЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НазначениеШаблона");
	НовыйЭлементОтбора.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
	НовыйЭлементОтбора.ПравоеЗначение 	= НазначениеШаблона;
	НовыйЭлементОтбора.Использование 	= ЗначениеЗаполнено(НазначениеШаблона);
	
КонецПроцедуры


//// //Экспорт шаблона        
&НаКлиенте
Процедура ЭкспортШаблонов(Команда) 
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭкспортМакетаЗавершение", ЭтотОбъект, ВыделенныеСтроки);
	ДиалогВыбораПапки.Показать(ОписаниеОповещения); 
	
КонецПроцедуры

 &НаКлиенте
Процедура ЭкспортМакетаЗавершение(ВыбранныеФайлы, ВыделенныеСтроки) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество() > 0 Тогда
		
		КаталогДляСохранения	= ВыбранныеФайлы.Получить(0);    
		ОписанияФайлов 			= ПоместитьФайлыВоВременноеХранилищеНаСервере(ВыделенныеСтроки); 
		
		Для Каждого ОписаниеФайла из ОписанияФайлов Цикл
			#Если ВебКлиент Тогда
				ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
				ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
				
				НачатьПолучениеФайлаССервера(ОписаниеФайла.АдресВоВременномХранилище, ОписаниеФайла.Представление, ПараметрыДиалогаПолученияФайлов);
			#Иначе 
				ДополнительныеПараметры = Новый Структура();
				ДополнительныеПараметры.Вставить("КаталогДляСохранения", КаталогДляСохранения);
				
				ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлыВКаталогЗавершение", ЭтотОбъект, ДополнительныеПараметры);
				
				КаталогДляСохранения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохранения);
				
				ПолучаемыеФайлы = Новый Массив;
				
				ПолучаемыйФайл 			= Новый ОписаниеПередаваемогоФайла;
				ПолучаемыйФайл.Имя 		= ОписаниеФайла.Представление;
				ПолучаемыйФайл.Хранение = ОписаниеФайла.АдресВоВременномХранилище;
				
				ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
				
				НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, КаталогДляСохранения, Ложь);
			#КонецЕсли  
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыВКаталогЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		Состояние(НСтр("ru = 'Сохранение успешно завершено'"), , НСтр("ru = 'в папку:'") + " " + ДополнительныеПараметры.КаталогДляСохранения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПодготовитьHTMLНаОсновеФорматированногоДокумента(ИмяПапки, ИмяФайла, Шаблон)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ДанныеШаблона = Справочники.CW_ОбщиеШаблоныДокументов.ДанныеШаблонаДокумента(Шаблон);

	ТекстовыйДокументHTML = Новый ТекстовыйДокумент;
	ТекстовыйДокументHTML.УстановитьТекст(ДанныеШаблона.ТекстHTML);
	// записываем документ во временную папку
	ТекстовыйДокументHTML.Записать(ПолноеИмяФайла, КодировкаТекста.UTF8);
	
	// Подготовим картинки
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + "_files";
	СоздатьКаталог(ПутьКПапкеКартинок);
	Для Каждого Картинка Из ДанныеШаблона.Вложения Цикл
		Картинка.Значение.Записать(ПутьКПапкеКартинок+ "\" + Картинка.Ключ + ".jpg");
	КонецЦикла;
	
	ВставитьКартинкиВHTML(ПолноеИмяФайла);
	
	УдалитьВременныйФайлНаСервер(ПутьКПапкеКартинок);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции    

&НаСервере
Функция ПодготовитьMXLНаОсновеТабличногоДокумента(ИмяПапки, ИмяФайла, Шаблон)
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);

	ТабличныйДокумент = Справочники.CW_ОбщиеШаблоныДокументов.ДанныеШаблонаДокумента(Шаблон);
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.MXL);
	
	Возврат ПолноеИмяФайла;
	
КонецФункции  

&НаСервере
Функция ПодготовитьXMLОписанияШаблона(ИмяПапки, ИмяФайла, Ссылка)   
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("template");  
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("id");  
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Ссылка));
	ЗаписьXML.ЗаписатьКонецЭлемента(); //id  
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("name");  
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Ссылка.Наименование));
	ЗаписьXML.ЗаписатьКонецЭлемента(); //name
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("formatname");  
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Ссылка.ИмяФормата));
	ЗаписьXML.ЗаписатьКонецЭлемента(); //formatname
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("target");  
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Ссылка.НазначениеШаблона.ПолноеИмя));
	ЗаписьXML.ЗаписатьКонецЭлемента(); //target
 	
	ЗаписьXML.ЗаписатьНачалоЭлемента("comment");  
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Ссылка.Комментарий));
	ЗаписьXML.ЗаписатьКонецЭлемента(); //comment

	ЗаписьXML.ЗаписатьКонецЭлемента(); //template
	
	ЗаписьXML.Закрыть();
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция СтруктураHTMLСКартинками(ТекстHTML)
	
	СтруктураHTML = Новый Структура();
	
	Вложения = Новый Структура();
	ТекстСДвоичнымиДанными = ТекстHTML;
	
	КоличествоВхождений = СтрЧислоВхождений(ТекстHTML, "data:image/");
	
	Для Сч = 1 По КоличествоВхождений Цикл
		// НачалоКартинкаВДвоичныхДанных - здесь начинается описание картинки в двоичных данных
		НачалоКартинкаВДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "data:image/");
		// НачалоДвоичныхДанных - здесь начинаются закодированные двоичные данные
		НачалоДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, ";base64,") + 8;
		// КартинкаВДвоичныхДанных - Текст двоичных данных, который нужно заменить на картинку в виде пути
		КартинкаВДвоичныхДанных = Сред(ТекстСДвоичнымиДанными, НачалоКартинкаВДвоичныхДанных, НачалоДвоичныхДанных-НачалоКартинкаВДвоичныхДанных);
		// Отрезаем использованную подстроку, чтобы повторно в ней не искать
		ТекстСДвоичнымиДанными = Сред(ТекстСДвоичнымиДанными, НачалоДвоичныхДанных);
		// КонецДвоичныхДанных - здесь заканчиваются закодированные двоичные данные
		КонецДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "='");
		Если КонецДвоичныхДанных = 0 Тогда
			КонецДвоичныхДанных = СтрНайти(ТекстСДвоичнымиДанными, "=""");
		КонецЕсли;
		// Непосредственно двоичные данные
		ДвоичныеДанные = Лев(ТекстСДвоичнымиДанными, КонецДвоичныхДанных);
		// Вставляем в виде вложения картинку
		Вложения.Вставить("image"+сч, Новый Картинка(Base64Значение(ДвоичныеДанные)));
		// Собрали текст для замены Картинки в двоичных данных, на картинку в виде вложения
		КартинкаВДвоичныхДанных = КартинкаВДвоичныхДанных + ДвоичныеДанные;
		// Отрезаем обработанную часть текста
		ТекстСДвоичнымиДанными = Сред(ТекстСДвоичнымиДанными, КонецДвоичныхДанных);
		// Меняем в тексте картинку в двоичных данных, на вложение.
		ТекстHTML = СтрЗаменить(ТекстHTML, КартинкаВДвоичныхДанных, "image"+сч);
	КонецЦикла;
	
	СтруктураHTML.Вставить("ТекстHTML", ТекстHTML);
	СтруктураHTML.Вставить("Вложения", Вложения);
	
	Возврат СтруктураHTML;
	
КонецФункции

&НаСервере
Процедура ВставитьКартинкиВHTML(ИмяФайлаHTML)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.Прочитать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	ТекстHTML = ТекстовыйДокумент.ПолучитьТекст();
	
	ФайлHTML = Новый Файл(ИмяФайлаHTML);
	
	ИмяПапкиКартинок = "_files";
	ПутьКПапкеКартинок = СтрЗаменить(ФайлHTML.ПолноеИмя, ФайлHTML.Имя, ИмяПапкиКартинок);
	
	// ожидается, что в папке будут только картинки
	ФайлыКартинок = НайтиФайлы(ПутьКПапкеКартинок, "*");
	
	Для Каждого ФайлКартинки Из ФайлыКартинок Цикл
		КартинкаТекстом = Base64Строка(Новый ДвоичныеДанные(ФайлКартинки.ПолноеИмя));
		КартинкаТекстом = "data:image/" + Сред(ФайлКартинки.Расширение,2) + ";base64," + Символы.ПС + КартинкаТекстом;
		
		ТекстHTML = СтрЗаменить(ТекстHTML, ФайлКартинки.ИмяБезРасширения, КартинкаТекстом);
	КонецЦикла;
		
	ТекстовыйДокумент.УстановитьТекст(ТекстHTML);
	ТекстовыйДокумент.Записать(ИмяФайлаHTML, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьФайлыВоВременноеХранилищеНаСервере(МассивШаблонов)
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);  
	
	МассивОписанияФайлов = Новый Массив;
	
	Для Каждого Шаблон из МассивШаблонов Цикл   
		
		СоставКомплекта = Новый Массив;
		
		ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(СокрЛП(Шаблон.Наименование));
	
		Если Шаблон.ИмяФормата = "HTML" Тогда
			ИмяФайла = СокрЛП(Шаблон) + ".htm";
			// Подготовим HTML документ на основе форматированного документа
			ПолноеИмяФайла = ПодготовитьHTMLНаОсновеФорматированногоДокумента(Папка, ИмяФайла, Шаблон);
		КонецЕсли; 
		
		Если Шаблон.ИмяФормата = "MXL" Тогда
			ИмяФайла = ИмяФайлаБезРасширения + ".mxl";
			// Подготовим PDF документ на основе табличного документа
			ПолноеИмяФайла = ПодготовитьMXLНаОсновеТабличногоДокумента(Папка, ИмяФайла, Шаблон);
		КонецЕсли;   
		
		СоставКомплекта.Добавить(ПолноеИмяФайла);
		
		//Общее описание шаблона
		ИмяФайла = "Template.xml";
		ПолноеИмяФайлаОписания = ПодготовитьXMLОписанияШаблона(Папка, ИмяФайла, Шаблон); 
		СоставКомплекта.Добавить(ПолноеИмяФайлаОписания);
		//Общее описание шаблона
		
		//Файл комплекта поставки шаблона
		ИмяФайла = ИмяФайлаБезРасширения + ".zip";
		ИмяФайлаКомплекта = УпаковатьZIPАрхив(Папка, ИмяФайла, СоставКомплекта);	
		//Файл комплекта поставки шаблона
		
		ДвоичныеДанные 				= Новый ДвоичныеДанные(ИмяФайлаКомплекта);
		ПутьВоВременномХранилище 	= ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);   
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ИмяФайла);
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		
		МассивОписанияФайлов.Добавить(ОписаниеФайла);
		
		УдалитьВременныйФайлНаСервер(ПолноеИмяФайлаОписания);
	
	КонецЦикла;
	
	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат МассивОписанияФайлов;
	
КонецФункции   

Функция УпаковатьZIPАрхив(ИмяПапки, ИмяФайла, СоставКомплекта) Экспорт
	
	ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла);

	//Упаковывваем в ZIP
	ЗаписьZipФайла = Новый ЗаписьZipФайла(ПолноеИмяФайла); 
	
	Для Каждого ПолныйПутьКФайлу из СоставКомплекта Цикл
		ЗаписьZipФайла.Добавить(ПолныйПутьКФайлу);     
	КонецЦикла;
	
	ЗаписьZipФайла.Записать();
	//Конец

	Возврат ПолноеИмяФайла;
	
КонецФункции
 //Экспорт шаблона


//Импорт шаблона
&НаКлиенте
Процедура ИмпортШаблонов(Команда) 
	
	ПараметрыДиалога	= Новый ПараметрыДиалогаПомещенияФайлов("Выберите файл поставки макета", Истина, "Zip архив (zip)|*.zip");
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ЗавершитьПомещениеФайла", ЭтотОбъект);
	НачатьПомещениеФайловНаСервер(ОписаниеОповещения,,,ПараметрыДиалога, ЭтаФорма.УникальныйИдентификатор);	   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПомещениеФайла(ПомещаемыеФайлы, ДополнительныеПараметры) Экспорт

	Если ПомещаемыеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мАдресаФайлов = Новый Массив;
	Для Каждого ОписаниеФайла из ПомещаемыеФайлы Цикл 
		мАдресаФайлов.Добавить(ОписаниеФайла.Адрес);
	КонецЦикла;
	
	УстановленыРасширения = Ложь;
	ЗавершитьПомещениеФайланаСервере(мАдресаФайлов, УстановленыРасширения); 
	
	Элементы.Список.Обновить();

	Состояние(НСтр("ru = 'Общие шаблоны успешно загружены'"));  
	
	Если УстановленыРасширения Тогда
		ПоказатьПредупреждение(, "Изменен состав расширений. Требуется перезапуск системы.");
	КонецЕсли;
	
КонецПроцедуры    

&НаСервере
Процедура ЗавершитьПомещениеФайланаСервере(мАдресаФайлов, УстановленыРасширения)  

	ИмяПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяПапки);     
	
	Для Каждого Адрес из мАдресаФайлов Цикл
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("zip");
		
		ФайлАрхива 	= Новый Файл(ИмяВременногоФайла);  
		ИмяПапкиАрхива 	= ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ФайлАрхива.Имя;
		СоздатьКаталог(ИмяПапкиАрхива);     
		
		ДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
		ДанныеФайла.Записать(ИмяВременногоФайла); 
		
		ЧтениеZipФайла = Новый ЧтениеZipФайла(ИмяВременногоФайла);   
		ЧтениеZipФайла.ИзвлечьВсе(ИмяПапкиАрхива, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		
		МассивФайлов = НайтиФайлы(ИмяПапкиАрхива,"*.*"); 
		
		ОписаниеШаблона 		= Новый Структура; 
		СоответствиеИменУзлов 	= ПолучитьСоответствиеИменУзлов();
		
		Для Каждого НайденныйФайл  из МассивФайлов Цикл
			Если НайденныйФайл.Расширение = ".xml" Тогда
				//Описание  
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.ОткрытьФайл(НайденныйФайл.ПолноеИмя);
				
				ПостроительDOM = Новый ПостроительDOM; 
				ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
				
				Элементы_template 	= ДокументDOM.ПолучитьЭлементыПоИмени("template");  
				Элемент_template 	= Элементы_template[0]; //всегда один   
				
				Для Каждого ДочернийУзел из Элемент_template.ДочерниеУзлы ЦИкл
					Ключ		= СоответствиеИменУзлов.Получить(ДочернийУзел.ИмяУзла);
					Значение	= СокрЛП(ДочернийУзел.ТекстовоеСодержимое);	
					
					ОписаниеШаблона.Вставить(Ключ, Значение);
				КонецЦикла;
				
			ИначеЕсли НайденныйФайл.Расширение = ".cfe" Тогда 
				//Расширение с функциями
				ПолноеИмяФайлаРасширения = НайденныйФайл.ПолноеИмя;
			Иначе
				//Шаблон
				ИмяФайлаШаблона = НайденныйФайл.ПолноеИмя;	
			КонецЕсли; 
		КонецЦикла;  
		
		Если ОписаниеШаблона.ИмяФормата = "MXL" Тогда
			Макет = Новый ТабличныйДокумент;
			Макет.Прочитать(ИмяФайлаШаблона);  
		КонецЕсли;
		
		Если ОписаниеШаблона.ИмяФормата = "HTML" Тогда
			ТекстовыйДокументHTML = Новый ТекстовыйДокумент;
			ТекстовыйДокументHTML.Прочитать(ИмяФайлаШаблона, КодировкаТекста.UTF8);
			Макет = СтруктураHTMLСКартинками(ТекстовыйДокументHTML.ПолучитьТекст());
		КонецЕсли;  
		
		Если Макет = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСсылка = Справочники.CW_ОбщиеШаблоныДокументов.ПолучитьСсылку(Новый УникальныйИдентификатор(ОписаниеШаблона.Ссылка)); 
		
		ОбъектОбщиеШаблоны = НайденнаяСсылка.ПолучитьОбъект();
		Если ОбъектОбщиеШаблоны = Неопределено Тогда
			ОбъектОбщиеШаблоны = Справочники.CW_ОбщиеШаблоныДокументов.СоздатьЭлемент();   
			ОбъектОбщиеШаблоны.УстановитьСсылкуНового(НайденнаяСсылка);
		КонецЕсли;
		
		ОбъектОбщиеШаблоны.ИмяФормата 	= ОписаниеШаблона.ИмяФормата;
		ОбъектОбщиеШаблоны.Наименование = ОписаниеШаблона.Наименование;
		ОбъектОбщиеШаблоны.Комментарий 	= ОписаниеШаблона.Комментарий;
		
		НазначениеШаблона = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ОписаниеШаблона.НазначениеШаблона);
		ОбъектОбщиеШаблоны.НазначениеШаблона = НазначениеШаблона;
		
		ОбъектОбщиеШаблоны.ХранилищеШаблона = Новый ХранилищеЗначения(Макет, Новый СжатиеДанных(9));
		
		ОбъектОбщиеШаблоны.Записать();  
		
		Если ПолноеИмяФайлаРасширения <> Неопределено Тогда
			
			ФайлРасширения = Новый Файл(ПолноеИмяФайлаРасширения);
			ПроверитьУдалитьРасширение(ФайлРасширения.ИмяБезРасширения);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайлаРасширения);
			
			УстановитьПривилегированныйРежим(Истина);  
			
			Расширение = РасширенияКонфигурации.Создать();
			Справочники.ВерсииРасширений.ОтключитьПредупрежденияБезопасности(Расширение);
			Справочники.ВерсииРасширений.ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
			Расширение.БезопасныйРежим = Ложь;
			Расширение.ИспользуетсяВРаспределеннойИнформационнойБазе = Истина;
			Расширение.Записать(ДвоичныеДанные); 
			
			УстановитьПривилегированныйРежим(Ложь);  
			УстановленыРасширения = истина;
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьВременныйФайлНаСервер(ИмяПапки);
	
КонецПроцедуры   

&НаСервере
Функция ПроверитьУдалитьРасширение(ИмяРасширения) 
	
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить(Новый Структура("Имя",ИмяРасширения));
	
	Если Расширения.Количество() > 0 Тогда   
		ИдентификаторыРасширений = Новый Массив;
		ИдентификаторыРасширений.Добавить(Расширения[0].УникальныйИдентификатор);
		
		ТекстОшибки = "";
		Справочники.ВерсииРасширений.УдалитьРасширения(ИдентификаторыРасширений, ТекстОшибки);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции 

&НаСервере
Функция ПолучитьСоответствиеИменУзлов()
	
	СоответствиеИменУзлов = Новый Соответствие;
	СоответствиеИменУзлов.Вставить("id", 			"Ссылка");     
	СоответствиеИменУзлов.Вставить("name", 			"Наименование");     
	СоответствиеИменУзлов.Вставить("formatname", 	"ИмяФормата"); 
	СоответствиеИменУзлов.Вставить("target", 		"НазначениеШаблона"); 
	СоответствиеИменУзлов.Вставить("comment", 		"Комментарий"); 

	Возврат СоответствиеИменУзлов;

КонецФункции
//Импорт шаблона


 &НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)

	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сохранение текста документа.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;

КонецПроцедуры   

 &НаСервере
 Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения 	= Файл.ИмяБезРасширения;
	Расширение 			= Файл.Расширение;
	Папка 				= Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;
	
КонецФункции



&НаКлиенте
Процедура УстановитьОтборСпискаНаКлиенте() 
	
	УстановитьОтборСписка();

КонецПроцедуры  

&НаКлиенте
Процедура СписокНазначенийПриАктивизацииСтроки(Элемент)  
	
	ЭлементСписка = Элементы.СписокНазначений.ТекущиеДанные;
	Если ЭлементСписка = Неопределено Тогда
		Если СписокНазначений.Количество() > 0 Тогда
			ЭлементСписка = СписокНазначений.Получить(0);              
		КонецЕсли;
	КонецЕсли;
	
	Если НазначениеШаблона <> ЭлементСписка.Значение Тогда
		НазначениеШаблона = ЭлементСписка.Значение; 
		ПодключитьОбработчикОжидания("УстановитьОтборСпискаНаКлиенте",0.1,Истина);   
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(НазначениеШаблона) Тогда
		СтрокаСписка =	СписокНазначений.НайтиПоЗначению(НазначениеШаблона);
		Элементы.СписокНазначений.ТекущаяСтрока = СтрокаСписка;   
	КонецЕсли;

КонецПроцедуры
